''' Модуль для розрахунку результатів проби Руф'є.

Сума вимірювань пульсу у трьох спробах (до навантаження, одразу після та після короткого відпочинку)
в ідеалі має бути не більше 200 ударів на хвилину.
Ми пропонуємо дітям вимірювати свій пульс протягом 15 секунд,
і наводимо результат до ударів за хвилину множенням на 4:
     S = 4* (P1 + P2 + P3)
Що далі цей результат від ідеальних 200 ударів, то гірше.
Зазвичай таблиці даються для величини, поділеної на 10. 

Індекс Руф'є
     IR = (S - 200) / 10
оцінюється за таблицею відповідно до віку:
        7-8             9-10                11-12               13-14               15+ (тільки для підлітків!)
чуд.     < 6.5           < 5                 < 3.5               < 2                 < 0.5  
доб.    >= 6.5 и < 12   >= 5 и < 10.5       >= 3.5 и < 9        >= 2 и < 7.5        >= 0.5 и < 6
задов.  >= 12 и < 17    >= 10.5 и < 15.5    >= 9 и < 14         >= 7.5 и < 12.5     >= 6 и < 11
слабкий >= 17 и < 21    >= 15.5 и < 19.5    >= 14 и < 18        >= 12.5 и < 16.5    >= 11 и < 15
незад.  >= 21           >= 19.5             >= 18               >= 16.5             >= 15

для будь-якого віку результат "незадовільно" віддалений від "слабкого" на 4,
той від "задовільного" на 5, а "добрий" від "задов" - на 5.5

тому напишемо функцію ruffier_result(r_index, level), яка отримуватиме
розрахований індекс Руф'є та рівень "незадов" для віку тестованого, і віддавати результат

'''
# тут задаються рядки, за допомогою яких викладено результат:
txt_index = "Ваш індекс Руф'є: "
txt_workheart = "Працездатність серця: "
txt_nodata = '''немає даних для такого віку'''
txt_res = [] 
txt_res.append('''низька. Терміново зверніться до лікаря!''')
txt_res.append('''задовільна. Зверніться до лікаря!''')
txt_res.append('''середня. Можливо, варто додатково обстежитись у лікаря.''')
txt_res.append('''вище середнього''')
txt_res.append('''висока''')

def ruffier_index(P1, P2, P3):
    ''' повертає значення індексу за трьома показниками пульсу для звірки з таблицею'''
    pass

def neud_level(age):
    ''' варіанти з віком менше 7 і дорослим треба обробляти окремо,
    тут підбираємо рівень "незадовільно" тільки всередині таблиці:
    у віці 7 років "неуд" - це індекс 21, далі кожні 2 роки він знижується на 1.5 до значення 15 в 15-16 років '''
    pass
    
def ruffier_result(r_index, level):
    ''' функція отримує індекс Руф'є і інтерпретує його,
    повертає рівень готовності: число від 0 до 4
    (що вище рівень готовності, то краще).  '''
    pass

def test(P1, P2, P3, age):
    ''' цю функцію можна використовувати зовні модуля для підрахунків індексу Руф'є.
    Повертає готові тексти, які залишається намалювати у потрібному місці
    Використовує для текстів константи, задані на початку цього модуля. '''
    pass

